
Процедура ЗаполнитьЗначенияПоУмолчанию(ОбъектЗаказ) Экспорт
	
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	ПеречислениеСсылкаСтавкиНДС = КМ_ОбщийМодульПовтИсп.МодульЯдро().ПолучитьСсылкиНаОбъектыКонфигурации("Перечисления_СтавкиНДС");
	
	ОбъектЗаказ.Организация 			= БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");	
	ОбъектЗаказ.СтавкаНДС 				= ПеречислениеСсылкаСтавкиНДС.НДС20;
	
#КонецЕсли

	ОбъектЗаказ.Статус 					= Перечисления.КМ_СтатусыЗаказов.Черновик;
	ОбъектЗаказ.ТипГрузовика 			= 5; //Тент
	ОбъектЗаказ.ТоннажАвто 				= 10;
	ОбъектЗаказ.КубатураАвто 			= 20;
	ОбъектЗаказ.ВесГруза 				= 5;
	ОбъектЗаказ.ОбъемГруза 				= 15;
	ОбъектЗаказ.ТемператураОт 			= 0;
	ОбъектЗаказ.ТемператураДо 			= 40;
	ОбъектЗаказ.ТипПогрузкиРазгрузки 	= 4;
	ОбъектЗаказ.СтратегияЗаданияЦены 	= "fixedPrice";
	ОбъектЗаказ.ТипЗаказа 				= "auction";
	ОбъектЗаказ.ШагИзмененияЦеныЗаказа 	= 500;
	ОбъектЗаказ.КонечнаяДатаТоргов 		= НачалоДня(ТекущаяДата() + 3 * КМ_ОбщийМодульКлиентСервер.Сутки());
	 
КонецПроцедуры
