
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.Владелец) Тогда
		
		ОтборВладелец = Неопределено;

		Для Каждого ЭлементОтбора Из Список.Отбор.Элементы Цикл
			Если Строка(ЭлементОтбора.ЛевоеЗначение) = "Владелец" Тогда

				ОтборВладелец = ЭлементОтбора;
				Прервать;

			КонецЕсли;
		КонецЦикла;

		Если ОтборВладелец = Неопределено Тогда

			ОтборВладелец 				= Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборВладелец.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");

		КонецЕсли;

		ОтборВладелец.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
		ОтборВладелец.ПравоеЗначение 	= Параметры.Владелец;
		ОтборВладелец.Использование 	= Истина;
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
