//Оснавная обработка работы с Каргомартом
//Подключает необходимые обработки (Модуль_Ядро) из макетов

Перем Модуль_Ядро Экспорт;

//Процедура инициализируем основную обработку БП/УТ
Процедура Модуль_Ядро() Экспорт

	Обработка = Обработки.КМ_РабочееМесто;
	
	//Определяем конфигурацию и возвращаем необходимое имя макета
	ИмяМакета = КМ_ОбщийМодульПовтИсп.ОпределениеЯдра();
	
	ФайлЯдра = ПолучитьМакет(ИмяМакета);
	
	АдресОбработки	 = ПоместитьВоВременноеХранилище(ФайлЯдра);
	ИмяОбработки	 = ПодключитьВнешююОбработку(АдресОбработки, Ложь);
	КМ_ОбщийМодуль_БП = ВнешниеОбработки.Создать(ИмяОбработки, Ложь);
	УдалитьИзВременногоХранилища(АдресОбработки);
	
КонецПроцедуры

Функция ОписаниеЗащитыБезПредупреждений()
	
	Результат = Неопределено;
	
	Попытка
		Результат = Новый("ОписаниеЗащитыОтОпасныхДействий");
	Исключение 
	КонецПопытки;
	
	Если Результат <> Неопределено Тогда
		Результат.ПредупреждатьОбОпасныхДействиях = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Подключает внешнюю обработку по адресу во временном хранилище
// или навигационной ссылке.
//
// Параметры:
//  АдресОбработки - Строка - адрес двоичных данных обработки во временном хранилище.
//
// Возвращаемое значение:
//   Строка - имя подключенной внешней обработки.
//
Функция ПодключитьВнешююОбработку(АдресОбработки, ИзменитьИмяОбработки) Экспорт
	
	БезопасныйРежим			 = Ложь;
	ЗащитаОтОпасныхДействий	 = ОписаниеЗащитыБезПредупреждений();
	
	Если ИзменитьИмяОбработки Тогда
		
		ИмяОбработки = Строка(Новый УникальныйИдентификатор);
		
	Иначе
		
		ИмяОбработки = Неопределено;
		
	КонецЕсли;
	
	Если ЗащитаОтОпасныхДействий = Неопределено Тогда
		
		Результат = ВнешниеОбработки.Подключить(АдресОбработки, ИмяОбработки, БезопасныйРежим);
		
	Иначе
		
		Результат = ВнешниеОбработки.Подключить(АдресОбработки, ИмяОбработки, БезопасныйРежим, ЗащитаОтОпасныхДействий);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


